app/views/teams/_form.html.erb

SELECT "players".* FROM "players"
---
    <%= form.label :players, style: "display: block" %>
    <%= form.collection_select :player_ids, Player.all, :id, :full_name, { multiple: true }, { class: "form-control" } %>