app/views/teams/index.html.erb

SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    <h2><%= team.name %></h2>
    <p><strong>Coach:</strong> <%= team.coach.first_name %> <%= team.coach.last_name %></p>