app/views/teams/show.html.erb

SELECT 1 AS one FROM "events" WHERE "events"."team_id" = ? LIMIT ?  [["team_id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."team_id" = ?  [["team_id", 2]]
---
        <div class="card-body">
          <% if @team.events.any? %>
            <div class="list-group">
              <% @team.events.each do |event| %>