app/views/teams/show.html.erb

SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---

<p>Coach: <%= @team.coach.first_name %> <%= @team.coach.last_name %></p>

SELECT "events".* FROM "events" WHERE "events"."team_id" = ?  [["team_id", 1]]
SELECT 1 AS one FROM "events" WHERE "events"."team_id" = ? LIMIT ?  [["team_id", 1], ["LIMIT", 1]]
---
<h2>Events</h2>
<% if @team.events.any? %>
  <ul>
    <% @team.events.each do |event| %>