app/views/events/_form.html.erb

    <%= form.label :team_id, "Team", style: "display: block" %>
    <%= form.collection_select :team_id, Team.all, :id, :name, { prompt: "Select a team" }, { class: "form-control" } %>
---
SELECT "teams".* FROM "teams"