app/views/events/_form.html.erb

        <%= form.label :team_id, "Team", class: "form-label" %>
        <%= form.collection_select :team_id,
            Team.all,
            :id,
            :name,
            {
---
SELECT "teams".* FROM "teams"