app/controllers/coaches_controller.rb

SELECT "coaches".* FROM "coaches"
---
  def index
    @coaches = Coach.all

INSERT INTO "coaches" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["first_name", "Jose"], ["last_name", "Mourinho"], ["email", "Jose@gmail.com"], ["created_at", "2024-11-15 23:23:55.860019"], ["updated_at", "2024-11-15 23:23:55.860019"]]
---
  def create
    @coach = Coach.new(coach_params)

    respond_to do |format|
      if @coach.save

DELETE FROM "coaches" WHERE "coaches"."id" = ?  [["id", 1]]
---
  def destroy
    @coach.destroy!

SELECT "coaches".* FROM "coaches" WHERE "coaches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_coach
      @coach = Coach.find(params[:id])