app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    if params[:event][:team_id].present?
      @event.team = Team.find_by(id: params[:event][:team_id])
      unless @event.team
        @event.errors.add(:team, "is invalid")
      end
    else
      @event.errors.add(:team, "must be selected")
    end

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "date", "location", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Practice"], ["date", "2024-11-05 14:30:00"], ["location", "London"], ["team_id", 2], ["created_at", "2024-11-19 19:45:02.232795"], ["updated_at", "2024-11-19 19:45:02.232795"]]

  def destroy
    @event.destroy!
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 2]]