app/controllers/events_controller.rb

  def team_events_json
    @team = Team.find(params[:team_id])
    @events = @team.events

    json_response = @events.map do |event|
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."team_id" = ?  [["team_id", 2]]

  def index
    @team = Team.find(params[:team_id]) # Fetch the specific team
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @team = Team.find(params[:team_id])    # Find the team using the team_id from the route
    @event = @team.events.find(params[:id])  # Find the event within that team
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."team_id" = ? AND "events"."id" = ? LIMIT ?  [["team_id", 2], ["id", 4], ["LIMIT", 1]]

  def create
    @event = Event.new(event_params)

    if params[:event][:team_id].present?
      @event.team = Team.find_by(id: params[:event][:team_id])
      unless @event.team
        @event.errors.add(:team, "is invalid")
      end
    else
      @event.errors.add(:team, "must be selected")
    end

    respond_to do |format|
      if @event.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", "2024-11-06 14:45:00"], ["updated_at", "2024-11-19 19:46:20.545203"], ["id", 3]]
INSERT INTO "events" ("name", "date", "location", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Game"], ["date", "2024-12-05 20:00:00"], ["location", "Stamford Bridge"], ["team_id", 2], ["created_at", "2024-12-05 01:38:39.386761"], ["updated_at", "2024-12-05 01:38:39.386761"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "date" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["date", "2024-11-16 18:30:00"], ["updated_at", "2024-11-16 20:35:19.290863"], ["id", 1]]

  def destroy
    @event.destroy!
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 10]]