app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."coach_id" = ?  [["coach_id", 1]]
---
  def index
    if coach_signed_in?
      @teams = current_coach.teams
    else
      @teams = Team.all

SELECT "players".* FROM "players" WHERE "players"."id" IN (?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4]]
INSERT INTO "teams" ("name", "members", "coach_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "Chelsea"], ["members", nil], ["coach_id", 1], ["created_at", "2024-11-16 20:18:56.987928"], ["updated_at", "2024-11-16 20:18:56.987928"]]
---
  def create
    @team = Team.new(team_params)
    @team.coach = current_coach

    # Assign selected players to the team
    if params[:player_ids]
      players = Player.find(params[:player_ids])
      @team.players = players
    end

    respond_to do |format|
      if @team.save

DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
---
  def destroy
    @team.destroy!