app/controllers/welcome_controller.rb

  def index
    @teams = Team.includes(:events) # Eager load events for teams
---
SELECT "events".* FROM "events" WHERE "events"."team_id" = ?  [["team_id", 1]]
SELECT "teams".* FROM "teams"